<?php
require_once('common.php');
require_once('page.php');

class AboutPage extends Page {
    public function getTitle() {
        return 'O(N)::About';
    }
    
    public function getContent() {
        $content = inBox('
            <h1>За системата</h1>
            Тази система е част от <a href="http://www.informatika.bg" target="_blank">informatika.bg</a>, като предоставя
            възможност потребителите на сайта да тренират наученото от темите върху задачи, давани на състезания.
            Тя е безплатна и свободна за ползване - кодът е достъпен като <a href="https://github.com/espr1t/action" target="_blank">GitHub проект</a>.

            <h3>Задачи</h3>
            Системата съдържа архив със задачи, давани от мен на различни състезания (национални и международни състезания,
            лагер-школи, курсове в университета, TopCoder, и други).

            <h3>Тренировка</h3>
            Системата също така има и възможност за структурирана подготовка, фокусираща се върху различни части от състезателната
            информатика. Надявам се да се получи нещо сходно на <a href="http://train.usaco.org/usacogate" target="_blank">USACO</a>
            трейнинга, като може да е безкрайно полезна за по-неопитни състезатели, тъй като темите ще бъдат подредени в нарастваща
            сложност.

            <h3>Игри</h3>
            За разлика от много други системи, съвсем скоро тази ще поддържа "игри" за двама или повече души, като всеки играч всъщност
            ще се състезава с изкуствен интелект, който е написал. Пример за такава игра е "змия за двама", в която две змии биха играли
            на една и съща дъска с ябълки, като се стремят да изядат възможно най-много, без да се блъснат в стена, в себе си, или в другата
            змия.

            <h3>Състезания</h3>
            По някое време системата ще почне да поддържа и състезания, като възнамерявам да има и такива с награди, спонсорирани от
            мен и други хора и организации.

            <h3>За контакти</h3>
            Системата се разработва и поддържа от мен - <a href="http://espr1t.net/me.html" target="_blank">Александър Георгиев</a>.
            <br><br>
            Ако забележите проблеми или имате предложения за подобрения, моля използвайте ликна "report a problem" в менюто долу.
            За други неща можете да се свържете с мен на <a href="mailto:thinkcreative@outlook.com" target="_self">thinkcreative@outlook.com</a>.
            <br><br>
            Последно, за да се свържете с други потребители на системата или за да покажете, че системата Ви харесва, можете да харесате
            <a href="https://www.facebook.com/informatika.bg/" target="_blank">страницата ни във Facebook</a>.
        ');
        return $content;
    }
    
}

?>